/* automatically generated by rust-bindgen 0.71.1 */

pub const MAX_ENTRIES: u32 = 8192;
pub const SAMPLE_MAX_ENTRIES: u32 = 8192;
pub const PENDING_MAX_ENTRIES: u32 = 8192;
pub const SAMPLES: u32 = 10;
pub const POLL_START: u32 = 0;
pub const POLL_END: u32 = 1;
pub const POLL_REGISTER_FILE: u32 = 2;
pub const EPOLL_START: u32 = 3;
pub const EPOLL_END: u32 = 4;
pub const EPOLL_INSERT_FILE: u32 = 5;
pub const EPOLL_REMOVE_FILE: u32 = 6;
pub const __BITS_PER_LONG: u32 = 64;
pub const __BITS_PER_LONG_LONG: u32 = 64;
pub type __s8 = ::std::os::raw::c_schar;
pub type __u8 = ::std::os::raw::c_uchar;
pub type __s16 = ::std::os::raw::c_short;
pub type __u16 = ::std::os::raw::c_ushort;
pub type __s32 = ::std::os::raw::c_int;
pub type __u32 = ::std::os::raw::c_uint;
pub type __s64 = ::std::os::raw::c_longlong;
pub type __u64 = ::std::os::raw::c_ulonglong;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct poll_start_event {
    pub event: __u8,
    pub tgid_pid: __u64,
    pub ts: __u64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of poll_start_event"][::std::mem::size_of::<poll_start_event>() - 24usize];
    ["Alignment of poll_start_event"][::std::mem::align_of::<poll_start_event>() - 8usize];
    ["Offset of field: poll_start_event::event"]
        [::std::mem::offset_of!(poll_start_event, event) - 0usize];
    ["Offset of field: poll_start_event::tgid_pid"]
        [::std::mem::offset_of!(poll_start_event, tgid_pid) - 8usize];
    ["Offset of field: poll_start_event::ts"]
        [::std::mem::offset_of!(poll_start_event, ts) - 16usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct poll_end_event {
    pub event: __u8,
    pub tgid_pid: __u64,
    pub ts: __u64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of poll_end_event"][::std::mem::size_of::<poll_end_event>() - 24usize];
    ["Alignment of poll_end_event"][::std::mem::align_of::<poll_end_event>() - 8usize];
    ["Offset of field: poll_end_event::event"]
        [::std::mem::offset_of!(poll_end_event, event) - 0usize];
    ["Offset of field: poll_end_event::tgid_pid"]
        [::std::mem::offset_of!(poll_end_event, tgid_pid) - 8usize];
    ["Offset of field: poll_end_event::ts"][::std::mem::offset_of!(poll_end_event, ts) - 16usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct poll_register_file_event {
    pub event: __u8,
    pub magic: __u32,
    pub i_rdev: __u32,
    pub tgid_pid: __u64,
    pub i_ino: __u64,
    pub ts: __u64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of poll_register_file_event"]
        [::std::mem::size_of::<poll_register_file_event>() - 40usize];
    ["Alignment of poll_register_file_event"]
        [::std::mem::align_of::<poll_register_file_event>() - 8usize];
    ["Offset of field: poll_register_file_event::event"]
        [::std::mem::offset_of!(poll_register_file_event, event) - 0usize];
    ["Offset of field: poll_register_file_event::magic"]
        [::std::mem::offset_of!(poll_register_file_event, magic) - 4usize];
    ["Offset of field: poll_register_file_event::i_rdev"]
        [::std::mem::offset_of!(poll_register_file_event, i_rdev) - 8usize];
    ["Offset of field: poll_register_file_event::tgid_pid"]
        [::std::mem::offset_of!(poll_register_file_event, tgid_pid) - 16usize];
    ["Offset of field: poll_register_file_event::i_ino"]
        [::std::mem::offset_of!(poll_register_file_event, i_ino) - 24usize];
    ["Offset of field: poll_register_file_event::ts"]
        [::std::mem::offset_of!(poll_register_file_event, ts) - 32usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct epoll_files_key {
    pub magic: __u32,
    pub i_rdev: __u32,
    pub i_ino: __u64,
    pub ep_address: __u64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of epoll_files_key"][::std::mem::size_of::<epoll_files_key>() - 24usize];
    ["Alignment of epoll_files_key"][::std::mem::align_of::<epoll_files_key>() - 8usize];
    ["Offset of field: epoll_files_key::magic"]
        [::std::mem::offset_of!(epoll_files_key, magic) - 0usize];
    ["Offset of field: epoll_files_key::i_rdev"]
        [::std::mem::offset_of!(epoll_files_key, i_rdev) - 4usize];
    ["Offset of field: epoll_files_key::i_ino"]
        [::std::mem::offset_of!(epoll_files_key, i_ino) - 8usize];
    ["Offset of field: epoll_files_key::ep_address"]
        [::std::mem::offset_of!(epoll_files_key, ep_address) - 16usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct epoll_register_file_event {
    pub event: __u8,
    pub magic: __u32,
    pub i_rdev: __u32,
    pub i_ino: __u64,
    pub ep_address: __u64,
    pub ts: __u64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of epoll_register_file_event"]
        [::std::mem::size_of::<epoll_register_file_event>() - 40usize];
    ["Alignment of epoll_register_file_event"]
        [::std::mem::align_of::<epoll_register_file_event>() - 8usize];
    ["Offset of field: epoll_register_file_event::event"]
        [::std::mem::offset_of!(epoll_register_file_event, event) - 0usize];
    ["Offset of field: epoll_register_file_event::magic"]
        [::std::mem::offset_of!(epoll_register_file_event, magic) - 4usize];
    ["Offset of field: epoll_register_file_event::i_rdev"]
        [::std::mem::offset_of!(epoll_register_file_event, i_rdev) - 8usize];
    ["Offset of field: epoll_register_file_event::i_ino"]
        [::std::mem::offset_of!(epoll_register_file_event, i_ino) - 16usize];
    ["Offset of field: epoll_register_file_event::ep_address"]
        [::std::mem::offset_of!(epoll_register_file_event, ep_address) - 24usize];
    ["Offset of field: epoll_register_file_event::ts"]
        [::std::mem::offset_of!(epoll_register_file_event, ts) - 32usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct epoll_start_event {
    pub event: __u8,
    pub tgid_pid: __u64,
    pub ep_address: __u64,
    pub ts: __u64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of epoll_start_event"][::std::mem::size_of::<epoll_start_event>() - 32usize];
    ["Alignment of epoll_start_event"][::std::mem::align_of::<epoll_start_event>() - 8usize];
    ["Offset of field: epoll_start_event::event"]
        [::std::mem::offset_of!(epoll_start_event, event) - 0usize];
    ["Offset of field: epoll_start_event::tgid_pid"]
        [::std::mem::offset_of!(epoll_start_event, tgid_pid) - 8usize];
    ["Offset of field: epoll_start_event::ep_address"]
        [::std::mem::offset_of!(epoll_start_event, ep_address) - 16usize];
    ["Offset of field: epoll_start_event::ts"]
        [::std::mem::offset_of!(epoll_start_event, ts) - 24usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct epoll_end_event {
    pub event: __u8,
    pub tgid_pid: __u64,
    pub ep_address: __u64,
    pub ts: __u64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of epoll_end_event"][::std::mem::size_of::<epoll_end_event>() - 32usize];
    ["Alignment of epoll_end_event"][::std::mem::align_of::<epoll_end_event>() - 8usize];
    ["Offset of field: epoll_end_event::event"]
        [::std::mem::offset_of!(epoll_end_event, event) - 0usize];
    ["Offset of field: epoll_end_event::tgid_pid"]
        [::std::mem::offset_of!(epoll_end_event, tgid_pid) - 8usize];
    ["Offset of field: epoll_end_event::ep_address"]
        [::std::mem::offset_of!(epoll_end_event, ep_address) - 16usize];
    ["Offset of field: epoll_end_event::ts"][::std::mem::offset_of!(epoll_end_event, ts) - 24usize];
};
