/* automatically generated by rust-bindgen 0.71.1 */

pub const __BITS_PER_LONG: u32 = 64;
pub const __BITS_PER_LONG_LONG: u32 = 64;
pub const TASK_COMM_LEN: u32 = 16;
pub type __s8 = ::std::os::raw::c_schar;
pub type __u8 = ::std::os::raw::c_uchar;
pub type __s16 = ::std::os::raw::c_short;
pub type __u16 = ::std::os::raw::c_ushort;
pub type __s32 = ::std::os::raw::c_int;
pub type __u32 = ::std::os::raw::c_uint;
pub type __s64 = ::std::os::raw::c_longlong;
pub type __u64 = ::std::os::raw::c_ulonglong;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct task_delay_acct {
    pub ts: __u64,
    pub pid: __u64,
    pub tid: __u64,
    pub comm: [::std::os::raw::c_char; 16usize],
    pub runtime_total: __u64,
    pub rq_delay_total: __u64,
    pub rq_count: __u64,
    pub uninterruptible_delay_total: __u64,
    pub blkio_delay_total: __u64,
    pub blkio_count: __u64,
    pub freepages_delay_total: __u64,
    pub freepages_count: __u64,
    pub thrashing_delay_total: __u64,
    pub thrashing_count: __u64,
    pub swapin_delay_total: __u64,
    pub swapin_count: __u64,
    pub nvcsw: __u64,
    pub nivcsw: __u64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of task_delay_acct"][::std::mem::size_of::<task_delay_acct>() - 152usize];
    ["Alignment of task_delay_acct"][::std::mem::align_of::<task_delay_acct>() - 8usize];
    ["Offset of field: task_delay_acct::ts"][::std::mem::offset_of!(task_delay_acct, ts) - 0usize];
    ["Offset of field: task_delay_acct::pid"]
        [::std::mem::offset_of!(task_delay_acct, pid) - 8usize];
    ["Offset of field: task_delay_acct::tid"]
        [::std::mem::offset_of!(task_delay_acct, tid) - 16usize];
    ["Offset of field: task_delay_acct::comm"]
        [::std::mem::offset_of!(task_delay_acct, comm) - 24usize];
    ["Offset of field: task_delay_acct::runtime_total"]
        [::std::mem::offset_of!(task_delay_acct, runtime_total) - 40usize];
    ["Offset of field: task_delay_acct::rq_delay_total"]
        [::std::mem::offset_of!(task_delay_acct, rq_delay_total) - 48usize];
    ["Offset of field: task_delay_acct::rq_count"]
        [::std::mem::offset_of!(task_delay_acct, rq_count) - 56usize];
    ["Offset of field: task_delay_acct::uninterruptible_delay_total"]
        [::std::mem::offset_of!(task_delay_acct, uninterruptible_delay_total) - 64usize];
    ["Offset of field: task_delay_acct::blkio_delay_total"]
        [::std::mem::offset_of!(task_delay_acct, blkio_delay_total) - 72usize];
    ["Offset of field: task_delay_acct::blkio_count"]
        [::std::mem::offset_of!(task_delay_acct, blkio_count) - 80usize];
    ["Offset of field: task_delay_acct::freepages_delay_total"]
        [::std::mem::offset_of!(task_delay_acct, freepages_delay_total) - 88usize];
    ["Offset of field: task_delay_acct::freepages_count"]
        [::std::mem::offset_of!(task_delay_acct, freepages_count) - 96usize];
    ["Offset of field: task_delay_acct::thrashing_delay_total"]
        [::std::mem::offset_of!(task_delay_acct, thrashing_delay_total) - 104usize];
    ["Offset of field: task_delay_acct::thrashing_count"]
        [::std::mem::offset_of!(task_delay_acct, thrashing_count) - 112usize];
    ["Offset of field: task_delay_acct::swapin_delay_total"]
        [::std::mem::offset_of!(task_delay_acct, swapin_delay_total) - 120usize];
    ["Offset of field: task_delay_acct::swapin_count"]
        [::std::mem::offset_of!(task_delay_acct, swapin_count) - 128usize];
    ["Offset of field: task_delay_acct::nvcsw"]
        [::std::mem::offset_of!(task_delay_acct, nvcsw) - 136usize];
    ["Offset of field: task_delay_acct::nivcsw"]
        [::std::mem::offset_of!(task_delay_acct, nivcsw) - 144usize];
};
