/* automatically generated by rust-bindgen 0.71.1 */

pub const TASK_COMM_LEN: u32 = 16;
pub const MAX_STACK_LEN: u32 = 127;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct task_delay_acct {
    pub ts: ::std::os::raw::c_ulonglong,
    pub pid: ::std::os::raw::c_ulonglong,
    pub tid: ::std::os::raw::c_ulonglong,
    pub comm: [::std::os::raw::c_char; 16usize],
    pub runtime_total: ::std::os::raw::c_ulonglong,
    pub rq_delay_total: ::std::os::raw::c_ulonglong,
    pub rq_count: ::std::os::raw::c_ulonglong,
    pub uninterruptible_delay_total: ::std::os::raw::c_ulonglong,
    pub blkio_delay_total: ::std::os::raw::c_ulonglong,
    pub blkio_count: ::std::os::raw::c_ulonglong,
    pub freepages_delay_total: ::std::os::raw::c_ulonglong,
    pub freepages_count: ::std::os::raw::c_ulonglong,
    pub thrashing_delay_total: ::std::os::raw::c_ulonglong,
    pub thrashing_count: ::std::os::raw::c_ulonglong,
    pub swapin_delay_total: ::std::os::raw::c_ulonglong,
    pub swapin_count: ::std::os::raw::c_ulonglong,
    pub nvcsw: ::std::os::raw::c_ulonglong,
    pub nivcsw: ::std::os::raw::c_ulonglong,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of task_delay_acct"][::std::mem::size_of::<task_delay_acct>() - 152usize];
    ["Alignment of task_delay_acct"][::std::mem::align_of::<task_delay_acct>() - 8usize];
    ["Offset of field: task_delay_acct::ts"][::std::mem::offset_of!(task_delay_acct, ts) - 0usize];
    ["Offset of field: task_delay_acct::pid"]
        [::std::mem::offset_of!(task_delay_acct, pid) - 8usize];
    ["Offset of field: task_delay_acct::tid"]
        [::std::mem::offset_of!(task_delay_acct, tid) - 16usize];
    ["Offset of field: task_delay_acct::comm"]
        [::std::mem::offset_of!(task_delay_acct, comm) - 24usize];
    ["Offset of field: task_delay_acct::runtime_total"]
        [::std::mem::offset_of!(task_delay_acct, runtime_total) - 40usize];
    ["Offset of field: task_delay_acct::rq_delay_total"]
        [::std::mem::offset_of!(task_delay_acct, rq_delay_total) - 48usize];
    ["Offset of field: task_delay_acct::rq_count"]
        [::std::mem::offset_of!(task_delay_acct, rq_count) - 56usize];
    ["Offset of field: task_delay_acct::uninterruptible_delay_total"]
        [::std::mem::offset_of!(task_delay_acct, uninterruptible_delay_total) - 64usize];
    ["Offset of field: task_delay_acct::blkio_delay_total"]
        [::std::mem::offset_of!(task_delay_acct, blkio_delay_total) - 72usize];
    ["Offset of field: task_delay_acct::blkio_count"]
        [::std::mem::offset_of!(task_delay_acct, blkio_count) - 80usize];
    ["Offset of field: task_delay_acct::freepages_delay_total"]
        [::std::mem::offset_of!(task_delay_acct, freepages_delay_total) - 88usize];
    ["Offset of field: task_delay_acct::freepages_count"]
        [::std::mem::offset_of!(task_delay_acct, freepages_count) - 96usize];
    ["Offset of field: task_delay_acct::thrashing_delay_total"]
        [::std::mem::offset_of!(task_delay_acct, thrashing_delay_total) - 104usize];
    ["Offset of field: task_delay_acct::thrashing_count"]
        [::std::mem::offset_of!(task_delay_acct, thrashing_count) - 112usize];
    ["Offset of field: task_delay_acct::swapin_delay_total"]
        [::std::mem::offset_of!(task_delay_acct, swapin_delay_total) - 120usize];
    ["Offset of field: task_delay_acct::swapin_count"]
        [::std::mem::offset_of!(task_delay_acct, swapin_count) - 128usize];
    ["Offset of field: task_delay_acct::nvcsw"]
        [::std::mem::offset_of!(task_delay_acct, nvcsw) - 136usize];
    ["Offset of field: task_delay_acct::nivcsw"]
        [::std::mem::offset_of!(task_delay_acct, nivcsw) - 144usize];
};
